Documents/ПрочееОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПрочееОприходованиеТоваров</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.алкАкцизПоПриобретеннымЦенностям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/алкАкцизПоПриобретеннымЦенностям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>алкАкцизПоПриобретеннымЦенностям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщееКоличествоПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>27</v8:Digits>
							<v8:FractionDigits>17</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеСырья</Name>
					<Type>
						<v8:Type>cfg:EnumRef.алкСостоянияПодакцизногоСырья</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатусАкциза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.алкСостоянияОплатыВходящегоАкциза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КБК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.алкКодыБюджетнойКлассификации2005</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПрочееОприходованиеТоваров/Ext/ObjectModule.bsl
//&После("ОбработкаПроведения")
//Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)   
//	
//	Сообщить("акцизы"); 
//	
//	Сообщить(дата);

//   	   // Добавим новую запись в регистр накопления МестоХраненияМатериалов.
//    НоваяЗапись = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();   
//	новаязапись.Активность=Истина;
//    НоваяЗапись.Организация = Организация;  
//	НоваяЗапись.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("01/06-2016 Д от 01.06.2016г."); 
//	НоваяЗапись.Период=Дата;
//	
//	//НоваяЗапись.МестоХранения = Справочники.МестоХраненияы.НайтиПоНаименованию("Основной");
//	//НоваяЗапись.Материалы = Справочники.Материалы.НайтиПоНаименованию("Доска обрезная");
//	//НоваяЗапись.Период = ТекущаяДата();
//    НоваяЗапись.Количество = 3000;  
//	НоваяЗапись.СуммаАкциза=600;

//    Движения.алкАкцизПоПриобретеннымЦенностям.Записать(Истина); // удалим старые записи и запишем вместо них новые

//	
//КонецПроцедуры   

&После("ОбработкаПроведения")
Процедура КГМ_ОбработкаПроведения(Отказ, РежимПроведения)
	// регистр КГМ_Прослеживаемость     
	
	//Если СокрЛП(Год(Дата))="2 021" Тогда 
	//	Коэф=0.031;  
	//Иначе 
		Коэф =0.032; 
	//КонецЕсли;
	
	Движения.алкАкцизПоПриобретеннымЦенностям.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл   
		
		//Если ТекСтрокаТовары.Номенклатура.алкТипПродукции=Перечисления.алкТипыАлкогольнойПродукции.Виноград Тогда
		
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры=Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Виноград") Тогда
			
			
		// Расход ====================================================================================================================
		Движение = Движения.алкАкцизПоПриобретеннымЦенностям.Добавить();  
		
		Движение.Активность=Истина;
		Движение.Период			= Дата; 
		Движение.Организация	= Организация; 
		Движение.ДоговорКонтрагента=Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("Номер","1-Виноград");
		Движение.Сделка= ссылка;   
			
		// Измерения 
		Движение.СерияНоменклатуры	= ТекСтрокаТовары.Серия;    
		Движение.Номенклатура=ТекСтрокаТовары.Номенклатура;

		Движение.СостояниеСырья		= Перечисления.алкСостоянияПодакцизногоСырья.ВМестахХранения;
		Движение.СтатусАкциза		= Перечисления.алкСостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ;
		
		Движение.Количество		= ТекСтрокаТовары.Количество;
		//Движение.Стоимость		= 0;
		Движение.СуммаАкциза	= Коэф*ТекСтрокаТовары.Количество;  
		Движение.КБК=Справочники.алкКодыБюджетнойКлассификации2005.НайтиПоКоду("18210302091011000110");
		Движение.СуммаПлатежа=ТекСтрокаТовары.Сумма;
		
		
		КонецЕсли;
		
		// Реквизиты
	КонецЦикла;
	
КонецПроцедуры
